Autodesk.Revit.DB.PlanViewRange.SetLevelId(Autodesk.Revit.DB.PlanViewPlane,Autodesk.Revit.DB.ElementId)
Set the level for a  View Depth plane
planViewPlane:
The View Depth plane
id:
Id of the level
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013